docs/1c-export-2026-06-02/Documents/Презентація.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>Презентація</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Презентації</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговийАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаявністьДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товари</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоментарМенеджера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

docs/1c-export-2026-06-02/Documents/Презентація/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регістр Презентації 
	Движения.Презентації.Записывать = Истина;
	Движения.Презентації.Очистить();
	Для Каждого ТекСтрокаТовари Из Товари Цикл
		Движение = Движения.Презентації.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовари.Номенклатура;
		Движение.Количество = 1;
		Движение.Коментар = ТекСтрокаТовари.Коментар;
		Движение.КоментарМенеджера = ТекСтрокаТовари.КоментарМенеджера;
	КонецЦикла;
	
	Если Не Отказ Тогда
	
		Артикулы  = Товари.Выгрузить(,"Номенклатура");
		Артикулы.Свернуть("Номенклатура");
		Для Каждого Элемент Из Артикулы Цикл 
			Запись = РегистрыСведений.АсортиментПрезентацій.СоздатьМенеджерЗаписи();
			Запись.Контрагент = Контрагент;
			Запись.Асортимент = Элемент.Номенклатура.Артикул + " " + Элемент.Номенклатура;
			Запись.Записать(Истина);	
		КонецЦикла;
		
		ОбменАндроид.ЗарегистрироватьОбъектОбменАндроид(Контрагент);

		
	КонецЕсли;
	
КонецПроцедуры
